Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_dpi.h
		struct {
			__IM  uint32_t            : 12;
			__IOM uint32_t dm_pd      : 1;            /*!< [12..12] DM PD                                                            */
			__IOM uint32_t dm_pu      : 1;            /*!< [13..13] DM PU                                                            */
			__IOM uint32_t dq0_pd     : 1;            /*!< [14..14] DQ0 PD                                                           */
			__IOM uint32_t dq0_pu     : 1;            /*!< [15..15] DQ0 PU                                                           */
			__IOM uint32_t dq1_pd     : 1;            /*!< [16..16] DQ1 PD                                                           */
			__IOM uint32_t dq1_pu     : 1;            /*!< [17..17] DQ1 PU                                                           */
			__IOM uint32_t dq2_pd     : 1;            /*!< [18..18] DQ2 PD                                                           */
			__IOM uint32_t dq2_pu     : 1;            /*!< [19..19] DQ2 PU                                                           */
			__IOM uint32_t dq3_pd     : 1;            /*!< [20..20] DQ3 PD                                                           */
			__IOM uint32_t dq3_pu     : 1;            /*!< [21..21] DQ3 PU                                                           */
			__IOM uint32_t dq4_pd     : 1;            /*!< [22..22] DQ4 PD                                                           */
			__IOM uint32_t dq4_pu     : 1;            /*!< [23..23] DQ4 PU                                                           */
			__IOM uint32_t dq5_pd     : 1;            /*!< [24..24] DQ5 PD                                                           */
			__IOM uint32_t dq5_pu     : 1;            /*!< [25..25] DQ5 PU                                                           */
			__IOM uint32_t dq6_pd     : 1;            /*!< [26..26] DQ6 PD                                                           */
			__IOM uint32_t dq6_pu     : 1;            /*!< [27..27] DQ6 PU                                                           */
			__IOM uint32_t dq7_pd     : 1;            /*!< [28..28] DQ7 PD                                                           */
			__IOM uint32_t dq7_pu     : 1;            /*!< [29..29] DQ7 PU                                                           */
			__IOM uint32_t dqs_p_pd   : 1;            /*!< [30..30] DQS PD                                                           */
			__IOM uint32_t dqs_p_pu   : 1;            /*!< [31..31] DQS PU                                                           */
		} dq_pupd_b;
	} ;
	__IM  uint32_t  RESERVED1[15];

	union {
		__IOM uint32_t crt_dmy;                     /*!< (@ 0x0000007C) CRT_DMY Register                                           */

		struct {
			__IOM uint32_t dmy        : 32;           /*!< [31..0] Dummy Registers                                                   */
		} crt_dmy_b;
	} ;
	__IM  uint32_t  RESERVED2[96];

	union {
		__IOM uint32_t adr_dly0;                    /*!< (@ 0x00000200) ADR_DLY_0 Register                                         */

		struct {
			__IOM uint32_t adr00_dly_sel : 4;         /*!< [3..0] Address[0] delay chain control                                     */
			__IOM uint32_t adr01_dly_sel : 4;         /*!< [7..4] Address[1] delay chain control                                     */
			__IOM uint32_t adr02_dly_sel : 4;         /*!< [11..8] Address[2] delay chain control                                    */
			__IOM uint32_t adr03_dly_sel : 4;         /*!< [15..12] Address[3] delay chain control                                   */
			__IOM uint32_t adr04_dly_sel : 4;         /*!< [19..16] Address[4] delay chain control                                   */
			__IOM uint32_t adr05_dly_sel : 4;         /*!< [23..20] Address[5] delay chain control                                   */
			__IOM uint32_t adr06_dly_sel : 4;         /*!< [27..24] Address[6] delay chain control                                   */
			__IOM uint32_t adr07_dly_sel : 4;         /*!< [31..28] Address[7] delay chain control                                   */
		} adr_dly0_b;
	} ;

	union {
		__IOM uint32_t adr_dly1;                    /*!< (@ 0x00000204) ADR_DLY_1 Register                                         */

		struct {
			__IOM uint32_t adr08_dly_sel : 4;         /*!< [3..0] Address[8] delay chain control                                     */
			__IOM uint32_t adr09_dly_sel : 4;         /*!< [7..4] Address[9] delay chain control                                     */
			__IOM uint32_t adr10_dly_sel : 4;         /*!< [11..8] Address[10] delay chain control                                   */
			__IOM uint32_t adr11_dly_sel : 4;         /*!< [15..12] Address[11] delay chain control                                  */
			__IOM uint32_t adr12_dly_sel : 4;         /*!< [19..16] Address[12] delay chain control                                  */
			__IOM uint32_t adr13_dly_sel : 4;         /*!< [23..20] Address[13] delay chain control                                  */
			__IOM uint32_t adr14_dly_sel : 4;         /*!< [27..24] Address[14] delay chain control                                  */
			__IOM uint32_t adr15_dly_sel : 4;         /*!< [31..28] Address[15] delay chain control                                  */
		} adr_dly1_b;
	} ;

	union {
		__IOM uint32_t adr_dly2;                    /*!< (@ 0x00000208) ADR_DLY_2 Register                                         */

		struct {
			__IOM uint32_t adr4_ext_dly_sel : 4;      /*!< [3..0] Extent address[4] delay chain control                              */
			__IOM uint32_t adr5_ext_dly_sel : 4;      /*!< [7..4] Extent address[5] delay chain control                              */
			__IOM uint32_t ba0_dly_sel : 4;           /*!< [11..8] BANK[0] delay chain control                                       */
			__IOM uint32_t ba1_dly_sel : 4;           /*!< [15..12] BANK[1] delay chain control                                      */
			__IOM uint32_t ba2_dly_sel : 4;           /*!< [19..16] BANK[2] delay chain control                                      */
		} adr_dly2_b;
	} ;

	union {
		__IOM uint32_t cmd_dly0;                    /*!< (@ 0x0000020C) CMD_DLY_0 Register                                         */

