Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_dpi.h
		struct {
			__IOM uint32_t cke_dly_sel : 4;           /*!< [3..0] CKE delay chain control                                            */
			__IOM uint32_t ras_n_dly_sel : 4;         /*!< [7..4] RAS_N delay chain control                                          */
			__IOM uint32_t cas_n_dly_sel : 4;         /*!< [11..8] CAS_N delay chain control                                         */
			__IOM uint32_t we_n_dly_sel : 4;          /*!< [15..12] WE_N delay chain control                                         */
			__IOM uint32_t odt_dly_sel : 4;           /*!< [19..16] ODT delay chain control                                          */
			__IOM uint32_t cs_n_dly_sel : 6;          /*!< [25..20] CS_N delay chain control                                         */
			__IOM uint32_t cs_n_1_dly_sel : 6;        /*!< [31..26] CS_N_1 delay chain control                                       */
		} cmd_dly0_b;
	} ;

	union {
		__IOM uint32_t pad_oe_ctl;                  /*!< (@ 0x00000210) PAD_OE_CTL Register                                        */

		struct {
			__IOM uint32_t adr00_oe   : 1;            /*!< [0..0] Ouput enable of address[00]                                        */
			__IOM uint32_t adr01_oe   : 1;            /*!< [1..1] Ouput enable of address[01]                                        */
			__IOM uint32_t adr02_oe   : 1;            /*!< [2..2] Ouput enable of address[02]                                        */
			__IOM uint32_t adr03_oe   : 1;            /*!< [3..3] Ouput enable of address[03]                                        */
			__IOM uint32_t adr04_oe   : 1;            /*!< [4..4] Ouput enable of address[04]                                        */
			__IOM uint32_t adr05_oe   : 1;            /*!< [5..5] Ouput enable of address[05]                                        */
			__IOM uint32_t adr06_oe   : 1;            /*!< [6..6] Ouput enable of address[06]                                        */
			__IOM uint32_t adr07_oe   : 1;            /*!< [7..7] Ouput enable of address[07]                                        */
			__IOM uint32_t adr08_oe   : 1;            /*!< [8..8] Ouput enable of address[08]                                        */
			__IOM uint32_t adr09_oe   : 1;            /*!< [9..9] Ouput enable of address[09]                                        */
			__IOM uint32_t adr10_oe   : 1;            /*!< [10..10] Ouput enable of address[10]                                      */
			__IOM uint32_t adr11_oe   : 1;            /*!< [11..11] Ouput enable of address[11]                                      */
			__IOM uint32_t adr12_oe   : 1;            /*!< [12..12] Ouput enable of address[12]                                      */
			__IOM uint32_t adr13_oe   : 1;            /*!< [13..13] Ouput enable of address[13]                                      */
			__IOM uint32_t adr14_oe   : 1;            /*!< [14..14] Ouput enable of address[14]                                      */
			__IOM uint32_t adr15_oe   : 1;            /*!< [15..15] Ouput enable of address[15]                                      */
			__IOM uint32_t ext_adr4_oe : 1;           /*!< [16..16] Ouput enable of Extent address[4]                                */
			__IOM uint32_t ext_adr5_oe : 1;           /*!< [17..17] Ouput enable of Extent address[5]                                */
			__IOM uint32_t bk0_oe     : 1;            /*!< [18..18] Ouput enable of BANK[0]                                          */
			__IOM uint32_t bk1_oe     : 1;            /*!< [19..19] Ouput enable of BANK[1]                                          */
			__IOM uint32_t bk2_oe     : 1;            /*!< [20..20] Ouput enable of BANK[2]                                          */
			__IOM uint32_t reset_n_oe : 1;            /*!< [21..21] Ouput enable of Reset_N                                          */
			__IOM uint32_t odt_oe     : 1;            /*!< [22..22] Ouput enable of ODT                                              */
			__IOM uint32_t we_n_oe    : 1;            /*!< [23..23] Ouput enable of WE_N                                             */
			__IOM uint32_t cas_n_oe   : 1;            /*!< [24..24] Ouput enable of CAS_N                                            */
			__IOM uint32_t ras_n_oe   : 1;            /*!< [25..25] Ouput enable of RAS_N                                            */
			__IOM uint32_t cke_oe     : 1;            /*!< [26..26] Ouput enable of CKE                                              */
			__IOM uint32_t cs_n_oe    : 1;            /*!< [27..27] Output enable of DCS_N                                           */
			__IOM uint32_t cs_n_1_oe  : 1;            /*!< [28..28] Output enable of DCS_N_1                                         */
			__IOM uint32_t dck_oe     : 1;            /*!< [29..29] Ouput enable of DCK                                              */
			__IOM uint32_t dck_1_oe   : 1;            /*!< [30..30] Output enable of DCK_1                                           */
			__IOM uint32_t adr54_1to1 : 1;            /*!< [31..31] Address[5:4] OCD control                                         */
		} pad_oe_ctl_b;
	} ;
	__IM  uint32_t  RESERVED3[5];

	union {
		__IOM uint32_t wrlvl_ctrl;                  /*!< (@ 0x00000228) WRLVL_CTRL Register                                        */

		struct {
			__IOM uint32_t wrlvl_en   : 1;            /*!< [0..0] Write level enable                                                 */
			__IOM uint32_t wrlvl_trig : 1;            /*!< [1..1] Write level trigger                                                */

			__IM  uint32_t            : 2;
			__IOM uint32_t wrlvl_fb_dqs : 4;          /*!< [7..4] Write level feedback MUX selection                                 */
			__IOM uint32_t wrlvl_fb_dq : 4;           /*!< [11..8] Write level feedback MUX selection                                */
			__IOM uint32_t wrlvl_dly_dqs : 4;         /*!< [15..12] Write level feedback delay 1T                                    */
			__IOM uint32_t wrlvl_dly_dq : 4;          /*!< [19..16] Write level feedback delay 1T                                    */
			__IOM uint32_t wait_ie    : 1;            /*!< [20..20] PSRAM WIAT IE control                                            */
			__IOM uint32_t cs_ph_sel  : 3;            /*!< [23..21] CS output delay                                                  */
			__IOM uint32_t cs_1_ph_sel : 3;           /*!< [26..24] CS_1 output delay                                                */
			__IOM uint32_t cmd_geardown : 1;          /*!< [27..27] Command output delay select                                      */
			__IOM uint32_t cs_geardown : 1;           /*!< [28..28] CS output delay select                                           */
			__IOM uint32_t cs_ph_en   : 1;            /*!< [29..29] CS output delay enable                                           */
			__IOM uint32_t cs_1_geardown : 1;         /*!< [30..30] CS_1 output delay select                                         */
			__IOM uint32_t cs_1_ph_en : 1;            /*!< [31..31] CS_1 output delay enable                                         */
		} wrlvl_ctrl_b;
	} ;

	union {
		__IOM uint32_t wrlvl_rd_data;               /*!< (@ 0x0000022C) WRLVL_RD_DATA Register                                     */

