Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_dpi.h
		struct {
			__IOM uint32_t dqs_dly_sel_0 : 4;         /*!< [3..0] Slice0 DQS delay chain control                                     */
			__IOM uint32_t dm_dly_sel_0 : 4;          /*!< [7..4] Slice0 DM delay chain control                                      */
			__IOM uint32_t dqs_dly_sel_1 : 4;         /*!< [11..8] Slice1 DQS delay chain control                                    */
			__IOM uint32_t dm_dly_sel_1 : 4;          /*!< [15..12] Slice1 DM delay chain control                                    */
			__IOM uint32_t dqs_dly_sel_2 : 4;         /*!< [19..16] Slice2 DQS delay chain control                                   */
			__IOM uint32_t dm_dly_sel_2 : 4;          /*!< [23..20] Slice2 DM delay chain control                                    */
			__IOM uint32_t dqs_dly_sel_3 : 4;         /*!< [27..24] Slice3 DQS delay chain control                                   */
			__IOM uint32_t dm_dly_sel_3 : 4;          /*!< [31..28] Slice3 DM delay chain control                                    */
		} dq_dly1_b;
	} ;

	union {
		__IOM uint32_t dq_dly2;                     /*!< (@ 0x0000024C) DQ_DLY Register 2                                          */

		struct {
			__IOM uint32_t dqs_oe_dly_sel_0 : 4;      /*!< [3..0] Slice0 DQS output enable delay chain control                       */
			__IOM uint32_t dqs_oe_dly_sel_1 : 4;      /*!< [7..4] Slice1 DQS output enable delay chain control                       */
			__IOM uint32_t dqs_oe_dly_sel_2 : 4;      /*!< [11..8] Slice2 DQS output enable delay chain control                      */
			__IOM uint32_t dqs_oe_dly_sel_3 : 4;      /*!< [15..12] Slice3 DQS output enable delay chain control                     */
		} dq_dly2_b;
	} ;
	__IM  uint32_t  RESERVED4;

	union {
		__IOM uint32_t read_ctrl0_0;                /*!< (@ 0x00000254) Read Control Register 0_0                                  */

		struct {
			__IOM uint32_t tm_dqs_en  : 5;            /*!< [4..0] dqs_en latency from read command                                   */

			__IM  uint32_t            : 3;
			__IOM uint32_t dqs_en_dly_sel : 6;        /*!< [13..8] dqs_en delay chain control                                        */
			__IOM uint32_t dqs_fifo_dly_sel : 2;      /*!< [15..14] dqs clock to read FIFO delay control                             */
			__IOM uint32_t dqs_det_dly_sel : 4;       /*!< [19..16] dqs_det delay control                                            */
			__IOM uint32_t dqs_rclin_dly_sel : 5;     /*!< [24..20] dqs clock to receive_1st delay control                           */
		} read_ctrl0_0_b;
	} ;

	union {
		__IOM uint32_t read_ctrl0_1;                /*!< (@ 0x00000258) Read Control Register 0_1                                  */

		struct {
			__IOM uint32_t tm_dqs_en  : 5;            /*!< [4..0] dqs_en latency from read command                                   */

			__IM  uint32_t            : 3;
			__IOM uint32_t dqs_en_dly_sel : 6;        /*!< [13..8] dqs_en delay chain control                                        */
			__IOM uint32_t dqs_fifo_dly_sel : 2;      /*!< [15..14] dqs clock to read FIFO delay control                             */
			__IOM uint32_t dqs_det_dly_sel : 4;       /*!< [19..16] dqs_det delay control                                            */
			__IOM uint32_t dqs_rclin_dly_sel : 5;     /*!< [24..20] dqs clock to receive_1st delay control                           */
		} read_ctrl0_1_b;
	} ;
	__IM  uint32_t  RESERVED5[2];

	union {
		__IOM uint32_t read_ctrl1;                  /*!< (@ 0x00000264) Read Control Register 1                                    */

		struct {
			__IOM uint32_t tm_rd_fifo : 5;            /*!< [4..0] read FIFO latency from read command                                */

			__IM  uint32_t            : 3;
			__IOM uint32_t dq_lat_en_force_sig : 1;   /*!< [8..8] If set dq_lat_en_force_sel, dq latch enable is controlled
                                                     by dq_lat_en_force_sig.                                                   */
			__IOM uint32_t dq_lat_en_force_sel : 1;   /*!< [9..9] dq latch control                                                   */
			__IOM uint32_t rd_dly_follow_dq0 : 1;     /*!< [10..10] When this field is set to 1, FW can program read delay
                                                     chain setting by dq0                                                      */
			__IOM uint32_t dqsen_cal_en : 1;          /*!< [11..11] DQS enable calibration                                           */
			__IOM uint32_t dqsen_cal_sel : 6;         /*!< [17..12] Central point of DQS enable calibratio                           */
			__IOM uint32_t dqsen_cal_pre_sel : 4;     /*!< [21..18] Left point of DQS enable calibration                             */
			__IOM uint32_t dqsen_cal_pos_sel : 4;     /*!< [25..22] Right of DQS enable calibration                                  */
		} read_ctrl1_b;
	} ;

	union {
		__IOM uint32_t read_ctrl2_0;                /*!< (@ 0x00000268) Read Control Register 2_0                                  */

		struct {
			__IOM uint32_t tm_odt_en  : 22;           /*!< [21..0] odt_en when read delay                                            */
			__IOM uint32_t odt_force_sig : 1;         /*!< [22..22] If set odt_force_sel, TE is controlled by odt_force_sig.         */
			__IOM uint32_t odt_force_sel : 1;         /*!< [23..23] ODT pad control.                                                 */
		} read_ctrl2_0_b;
	} ;

	union {
		__IOM uint32_t read_ctrl2_1;                /*!< (@ 0x0000026C) Read Control Register 2_1                                  */

		struct {
			__IOM uint32_t tm_odt_en  : 22;           /*!< [21..0] odt_en when read delay                                            */
			__IOM uint32_t odt_force_sig : 1;         /*!< [22..22] If set odt_force_sel, TE is controlled by odt_force_sig.         */
			__IOM uint32_t odt_force_sel : 1;         /*!< [23..23] ODT pad control.                                                 */
		} read_ctrl2_1_b;
	} ;
	__IM  uint32_t  RESERVED6[18];

	union {
		__IOM uint32_t dqs_in_dly_0;                /*!< (@ 0x000002B8) DQS In Delay Register 0                                    */

