Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_dpi.h
		struct {
			__IOM uint32_t ne         : 3;            /*!< [2..0] Driving control                                                    */

			__IM  uint32_t            : 1;
			__IOM uint32_t pe         : 3;            /*!< [6..4] Driving control                                                    */

			__IM  uint32_t            : 3;
			__IOM uint32_t smt        : 1;            /*!< [10..10] Schmitt trigger                                                  */

			__IM  uint32_t            : 1;
			__IOM uint32_t ttcn       : 4;            /*!< [15..12] On die termination control                                       */
			__IOM uint32_t ttcp       : 4;            /*!< [19..16] On die termination control                                       */
		} dqs_p_pad_ctrl_b;
	} ;
	__IM  uint32_t  RESERVED8[21];

	union {
		__IOM uint32_t dpi_ctrl0;                   /*!< (@ 0x0000037C) DPI Control Register 0                                     */

		struct {
			__IOM uint32_t fw_set_mode : 2;           /*!< [1..0] FW set delay chain of data slice mode                              */
			__IOM uint32_t rst_fifo_mode : 2;         /*!< [3..2] Reset read FIFO pointer mode                                       */
			__IOM uint32_t cal_set_mode : 2;          /*!< [5..4] 3-point calibration set mode                                       */
			__IOM uint32_t dqsen_mode : 2;            /*!< [7..6] Generate DQS enable mode                                           */
			__IOM uint32_t ref_update_dly : 6;        /*!< [13..8] Update delay chain setting after receiving refresh command        */
			__IOM uint32_t ref_cmd_sel : 1;           /*!< [14..14] DDR command swap, when ref_cmd_sel == 1                          */

			__IM  uint32_t            : 1;
			__IOM uint32_t rd_update_dly : 5;         /*!< [20..16] Update delay chain setting after read data enable                */
			__IOM uint32_t wr_update_dly : 3;         /*!< [23..21] Update delay chain setting after write data enable               */
			__IOM uint32_t cmd_ph_en  : 1;            /*!< [24..24] Command output delay enable                                      */
			__IOM uint32_t cmd_ph_sel : 3;            /*!< [27..25] Command output delay                                             */
		} dpi_ctrl0_b;
	} ;

	union {
		__IOM uint32_t dpi_ctrl1;                   /*!< (@ 0x00000380) DPI Control Register 1                                     */

		struct {
			__IOM uint32_t fw_set_wr_dly : 1;         /*!< [0..0] FW set write delay chain of data slice                             */

			__OM  uint32_t write_en_0 : 1;            /*!< [1..1] Enable of the following row                                        */
			__OM  uint32_t fw_set_rd_dly : 1;         /*!< [2..2] FW set read delay chain of data slice                              */
			__OM  uint32_t write_en_1 : 1;            /*!< [3..3] Enable of the following row                                        */
			__OM  uint32_t fw_set_cal_range : 1;      /*!< [4..4] FW set 3-point calibration range                                   */
			__OM  uint32_t write_en_2 : 1;            /*!< [5..5] Enable of the following row                                        */
			__OM  uint32_t fw_set_rd_det : 1;         /*!< [6..6] FW set read delay chain of valid window detection                  */
			__OM  uint32_t write_en_3 : 1;            /*!< [7..7] Enable of the following row                                        */
		} dpi_ctrl1_b;
	} ;
	__IM  uint32_t  RESERVED9[21];

	union {
		__IOM uint32_t bist_2to1_0;                 /*!< (@ 0x000003D8) bist 2to1 Register 0                                       */

		struct {
			__IOM uint32_t bist_debug_sel : 5;        /*!< [4..0] debug selection                                                    */

			__IM  uint32_t            : 15;
			__IOM uint32_t bist_mode  : 3;            /*!< [22..20] Bist mode                                                        */
			__IOM uint32_t bist_en    : 1;            /*!< [23..23] Enable bist circuit in PHY                                       */
			__IOM uint32_t b_2to1_wrlv_delay_0 : 1;   /*!< [24..24] slice0 add one cycle delay for write leveling                    */
			__IOM uint32_t b_2to1_wrlv_delay_1 : 1;   /*!< [25..25] slice1 add one cycle delay for write leveling                    */
			__IOM uint32_t b_2to1_wrlv_delay_2 : 1;   /*!< [26..26] slice2 add one cycle delay for write leveling                    */
			__IOM uint32_t b_2to1_wrlv_delay_3 : 1;   /*!< [27..27] slice3 add one cycle delay for write leveling                    */
			__IOM uint32_t b_2to1_en_dq : 1;          /*!< [28..28] For data slice                                                   */
			__IOM uint32_t b_2to1_wrdelay : 1;        /*!< [29..29] add one cycle delay for write command                            */
			__IOM uint32_t b_2to1_rddelay : 1;        /*!< [30..30] add one cycle delay for read command                             */
			__IOM uint32_t b_2to1_en_adr : 1;         /*!< [31..31] For address and command slice                                    */
		} bist_2to1_0_b;
	} ;
	__IM  uint32_t  RESERVED10[3];

	union {
		__IOM uint32_t int_ctrl;                    /*!< (@ 0x000003E8) Init Control Register                                      */

		struct {
			__IOM uint32_t int_dqs_en : 1;            /*!< [0..0] dqs_int enable                                                     */

			__OM  uint32_t write_en_0 : 1;            /*!< [1..1] Enable of the following row                                        */
			__IOM uint32_t int_cal_bdy_en : 1;        /*!< [2..2] cal_bdy_int enable                                                 */

			__OM  uint32_t write_en_1 : 1;            /*!< [3..3] Enable of the following row                                        */
			__IOM uint32_t fw_clr_dqs_int : 1;        /*!< [4..4] FW clear dqs_int (one cycle pulse, HW auto clear)                  */

			__OM  uint32_t write_en_2 : 1;            /*!< [5..5] Enable of the following row                                        */
			__IOM uint32_t int_cpu_0_en : 1;          /*!< [6..6] To CPU 0 interrupt enable                                          */

			__OM  uint32_t write_en_3 : 1;            /*!< [7..7] Enable of the following row                                        */
			__IOM uint32_t int_cpu_1_en : 1;          /*!< [8..8] To CPU 1 interrupt enable                                          */

